In [1]:
df <- read.csv('../Data/Airlinewise Monthly International Air Traffic To And From The Indian Territory.csv')

In [2]:
summary(df)

      YEAR          MONTH      QUARTER           AIRLINE.NAME    CARRIER.TYPE
 Min.   :2015   FEB    : 264   Q1:792   AEROFLOT       :  27   DOMESTIC: 135
 1st Qu.:2015   JAN    : 264   Q2:504   AEROLOGIC      :  27   FOREIGN :2199
 Median :2016   MAR    : 264   Q3:507   AIR ARABIA     :  27
 Mean   :2016   DEC    : 177   Q4:531   AIR ASIA BERHAD:  27
 3rd Qu.:2016   NOV    : 177            AIR ASTANA     :  27
 Max.   :2017   OCT    : 177            AIR AUSTRAL    :  27
                (Other):1011            (Other)        :2172
 PASSENGERS.TO.INDIA PASSENGERS.FROM.INDIA FREIGHT.TO.INDIA
 Min.   :     0      Min.   :     0        Min.   :    0.00
 1st Qu.:  1488      1st Qu.:  1629        1st Qu.:    0.30
 Median :  4960      Median :  5264        Median :   53.95
 Mean   : 24477      Mean   : 25453        Mean   :  550.93
 3rd Qu.: 23290      3rd Qu.: 23419        3rd Qu.:  311.21
 Max.   :402497      Max.   :400155        Max.   :14916.47
 NA's   :1
 FREIGHT.FROM.INDIA
 Min.   :    0.00
 1st Qu.:    8.53
 Median :  154.32
 Mean   :  865.26
 3rd Qu.:  770.03
 Max.   :48640.30

In [3]:
months <- data.frame(unique(df$MONTH))

In [4]:
plot(sort(df$FREIGHT.FROM.INDIA , df$MONTH ))
ylabel("Months")

ERROR: Error in sort(df$FREIGHT.FROM.INDIA, df$MONTH): 'decreasing' must be a length-1 logical vector.
Did you intend to set 'partial'?

In [5]:
utf8ToInt("Bb")

[1] 66 98

In [3]:
data.frame(LETTERS[1:10] , utf8ToInt(paste(LETTERS[0:10],sep="",collapse="")))

   LETTERS.1.10. utf8ToInt.paste.LETTERS.0.10...sep.......collapse.......
1  A             65
2  B             66
3  C             67
4  D             68
5  E             69
6  F             70
7  G             71
8  H             72
9  I             73
10 J             74

In [4]:
ls()

character(0)

## Encryption and Decryption

In [5]:
message = utf8ToInt("Tejas is a boy")
code = 13 #Code should always be a prime number

rem = message %% code
quotient = message %/% code

final_codeVector = quotient * code + rem

In [6]:
intToUtf8(final_codeVector)

[1] "Tejas is a boy"

In [7]:
'Tejas'

[1] "Tejas"

In [48]:
df = data.frame(Names = c('Radha','Monika','Sawan','Ram','Tejas') , Surnames = c('Rao','Sharma','Doshi','Ranade','Shinde'))

In [49]:
df

  Names  Surnames
1 Radha  Rao
2 Monika Sharma
3 Sawan  Doshi
4 Ram    Ranade
5 Tejas  Shinde

In [50]:
findInitials = function(name , surname)
    {
        return (paste(substr(name , 1 , 1) , substr(surname , 1 , 1) , sep = "" , collapse = ""))
    }

In [51]:
vowelCount = function(name)
    {
        coll = is.element(unlist(strsplit(tolower(name),'')),c('a','e','i','o','u'))
        return (length(coll[coll == TRUE]))
    }

In [52]:
removeVowel = function (name)
    {
        return (gsub('a|e|i|o|u','',name))
    }

In [53]:
match('a' , unlist(strsplit('Tejaas' , '')))

[1] 4

In [54]:
vowelCount('Tejaaas')

[1] 4

In [55]:
findInitials('Tejas','Shinde')

[1] "TS"

In [56]:
df$removeVowelsFN = apply(df[1] , removeVowel , MARGIN = 1)

In [57]:
df$VowelCount = apply(df[1] , vowelCount , MARGIN = 1)

In [58]:
df$Initials = mapply(findInitials , df$Names , df$Surnames)

In [59]:
df$LengthInSurname = apply(df[2] , nchar , MARGIN = 1)

In [60]:
df

  Names  Surnames removeVowelsFN VowelCount Initials LengthInSurname
1 Radha  Rao      Rdh            2          RR       3
2 Monika Sharma   Mnk            3          MS       6
3 Sawan  Doshi    Swn            2          SD       5
4 Ram    Ranade   Rm             1          RR       6
5 Tejas  Shinde   Tjs            2          TS       6

In [63]:
rbind(df , c(apply(df , vowelCount , MARGIN = 2)))
dataframe$sqrt = apply(dataframe[1] , sqrt , MARGIN = 1)

Warning message in `[<-.factor`(`*tmp*`, ri, value = 10L):
"invalid factor level, NA generated"Warning message in `[<-.factor`(`*tmp*`, ri, value = 11L):
"invalid factor level, NA generated"

  Names  Surnames removeVowelsFN VowelCount Initials LengthInSurname
1 Radha  Rao      Rdh            2          RR       3
2 Monika Sharma   Mnk            3          MS       6
3 Sawan  Doshi    Swn            2          SD       5
4 Ram    Ranade   Rm             1          RR       6
5 Tejas  Shinde   Tjs            2          TS       6
6 NA     NA       0              0          0        0

In [83]:
dataframe = data.frame(Numbers = 1:10)

In [84]:
dataframe$sqrt = apply(dataframe[1] , sqrt , MARGIN = 2 )
dataframe$sqre = apply(dataframe[1] ,  function(n){return (n^2)}, MARGIN = 2 )
dataframe = rbind(dataframe , c(sum(dataframe$Numbers) , sum(dataframe$sqrt) , sum(dataframe$sqre)))
dataframe$mean = apply(dataframe , mean , MARGIN = 1)

In [85]:
dataframe

   Numbers sqrt      sqre mean
1   1       1.000000   1    1.000000
2   2       1.414214   4    2.471405
3   3       1.732051   9    4.577350
4   4       2.000000  16    7.333333
5   5       2.236068  25   10.745356
6   6       2.449490  36   14.816497
7   7       2.645751  49   19.548584
8   8       2.828427  64   24.942809
9   9       3.000000  81   31.000000
10 10       3.162278 100   37.720759
11 55      22.468278 385  154.156093

In [86]:
rownames(dataframe)[length(rownames(dataframe))] = 'Total'

In [87]:
dataframe

      Numbers sqrt      sqre mean
1      1       1.000000   1    1.000000
2      2       1.414214   4    2.471405
3      3       1.732051   9    4.577350
4      4       2.000000  16    7.333333
5      5       2.236068  25   10.745356
6      6       2.449490  36   14.816497
7      7       2.645751  49   19.548584
8      8       2.828427  64   24.942809
9      9       3.000000  81   31.000000
10    10       3.162278 100   37.720759
Total 55      22.468278 385  154.156093

In [6]:
2 %% 5

[1] 2

In [7]:
2 %/% 5

[1] 0

In [8]:
substr('Tejas' , 1 , 3)

[1] "Tej"

In [9]:
seq(1,10,2)

[1] 1 3 5 7 9

In [12]:
matrix(c(1,2,3,4,5,6,7,8,9) , ncol = 3 , byrow = T)

     [,1] [,2] [,3]
[1,] 1    2    3
[2,] 4    5    6
[3,] 7    8    9

In [13]:
rep(2,5)

[1] 2 2 2 2 2

In [35]:
mtcars[mtcars$mpg <= 20]

ERROR: Error in parse(text = x, srcfile = src): <text>:1:24: unexpected ';'
1: mtcars[mtcars$mpg <= 20;
                           ^

In [24]:
df = mtcars['cyl'] > 6

In [32]:
ifelse(df['cyl'] , 'Works' , 'Not')

[1] NA

In [44]:
subset(mtcars , mpg < 20)[1:9]

                    mpg  cyl disp  hp  drat wt    qsec  vs am
Hornet Sportabout   18.7 8   360.0 175 3.15 3.440 17.02 0  0
Valiant             18.1 6   225.0 105 2.76 3.460 20.22 1  0
Duster 360          14.3 8   360.0 245 3.21 3.570 15.84 0  0
Merc 280            19.2 6   167.6 123 3.92 3.440 18.30 1  0
Merc 280C           17.8 6   167.6 123 3.92 3.440 18.90 1  0
Merc 450SE          16.4 8   275.8 180 3.07 4.070 17.40 0  0
Merc 450SL          17.3 8   275.8 180 3.07 3.730 17.60 0  0
Merc 450SLC         15.2 8   275.8 180 3.07 3.780 18.00 0  0
Cadillac Fleetwood  10.4 8   472.0 205 2.93 5.250 17.98 0  0
Lincoln Continental 10.4 8   460.0 215 3.00 5.424 17.82 0  0
Chrysler Imperial   14.7 8   440.0 230 3.23 5.345 17.42 0  0
Dodge Challenger    15.5 8   318.0 150 2.76 3.520 16.87 0  0
AMC Javelin         15.2 8   304.0 150 3.15 3.435 17.30 0  0
Camaro Z28          13.3 8   350.0 245 3.73 3.840 15.41 0  0
Pontiac Firebird    19.2 8   400.0 175 3.08 3.845 17.05 0  0
Ford Pantera L      15.8 8   351.0 264 4.22 3.170 14.50 0  1
Ferrari Dino        19.7 6   145.0 175 3.62 2.770 15.50 0  1
Maserati Bora       15.0 8   301.0 335 3.54 3.570 14.60 0  1